Revit 2022 API
MacroModule.RemoveMacro Method
 Removes a macro from the module.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2014
Syntax
C#
public void RemoveMacro(
	Macro macro
)
Visual Basic
Public Sub RemoveMacro ( _
	macro As Macro _
)
Visual C++
public:
void RemoveMacro(
	Macro^ macro
)
Parameters
macro
Type: Autodesk.Revit.DB.Macros.Macro
 The macro will be removed from this module.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace